{
  "en": {
    "sabas_portfolio": "Saba's Portfolio",
    "home": "Home",
    "about_me": "About me",
    "my_skills": "My Skills",
    "projects": "Projects",
    "experience": "Experience",
    "certifications": "Certifications",
    "Welcome": "Welcome",
    "welcome_text_desc": "My name is Saba Jmukhadze. From Tbilisi, Georgia, I am actively involved in Full-Stack Web & Mobile development, specializing in Front-End using React.js and Back-End using Node.js.",
    "contact": "Contact Information",
    "contact_second": "Contact",
    "address": "Address",
    "mobile_number": "Mobile Number",
    "email": "Email",
    "georgia": "Georgia",
    "tbilisi": "Tbilisi",
    "didi_dighomi": "Didi-Dighomi",
    "close": "Close",
    "Enter_Your_Name": "Enter Your Name",
    "Enter_Your_Email": "Enter Your Email",
    "message": "Message",
    "thank_you": "Thank You",
    "success_message": "Message sent successfully",
    "email_valid_error": "Please enter a valid email address.",
    "send_message": "Send",
    "h": "H",
    "i": "I",
    "hello_text": "ello, my name is Saba Jmukhadze from Tbilisi. I am a self-taught Full-Stack developer. My main focus is on attention to detail, which is crucial for any programmer. I have always been curious about how games and websites are created. One day, I made the decision to embark on a self-study journey. In my opinion, attending a university or college is not a prerequisite for becoming a professional. The key is to dedicate yourself to continuous learning and self-improvement. My goal is to gain practical experience in the field and engage in daily learning to foster personal growth.",
    "start_learning_text": "started learning to code from freeCodeCamp.org. You can find links to my certifications below. Afterward, I continued my learning journey through YouTube, which is a common path for self-taught developers. However, I am not the kind of person who spends all day watching tutorials on how to accomplish specific tasks. In my opinion, genuine learning begins with hands-on practice. It is essential to build projects to reinforce your skills. Initially, you may make numerous mistakes, but practice is transformative and leads to improvement over time.",
    "external_links": "External links",
    "education": "Education",
    "georgian_technical_university": "Georgian Technical University",
    "bachelors_degree_in_architecture": "Bachelor's Degree In Architecture",
    "my_skills_are": "My Skills Are",
    "created_title": "I have created several mobile-responsive websites using React.JS. Simply select the one you like and take a look.",
    "s": "N",
    "note_text": "Please be aware that most of the projects listed below were created during my time as a junior developer and are currently still under development. On average, I allocated two days to each project, with intentions to update them in the near future.",
    "view_project": "View Project",
    "bazargeDesc": "This app is for online buying and selling. I am currently working on this project, and I am planning to add many more functionalities. You can register, log in, and post your items for sale.",
    "developer": "Developer",
    "my_new_project_title": "My New Small E-commerce Project",
    "my_new_project_text": "I created this using React.js. I utilized Context API and Redux Toolkit for state management.",
    "all_rights_reserved": "All Rights Reserved - By Saba Jmukhadze",
    "gta_sanandreas_text": "My portfolio website features a modified soundtrack inspired by the iconic music from 'GTA San Andreas' for entertainment purposes only. It does not infringe upon any copyrights or claim ownership of the original composition."
  },
  "geo": {
    "sabas_portfolio": "პორტფოლიო",
    "home": "მთავარი",
    "about_me": "ჩემს შესახებ",
    "my_skills": "უნარები",
    "projects": "პროექტები",
    "experience": "გამოცდილება",
    "certifications": "სერთიფიკატები",
    "Welcome": "გამარჯობა",
    "welcome_text_desc": "ჩემი სახელია საბა ჯმუხაძე, აქტიურად ვარ ჩართული Full-Stack დეველოპმენტში, Front-End: React.js და Back-End: Node.js...",
    "contact": "საკონტაქტო ინფორმაცია",
    "contact_second": "კონტაქტი",
    "address": "მისამართი",
    "mobile_number": "მობილური",
    "email": "მეილი",
    "georgia": "საქართველო",
    "tbilisi": "თბილისი",
    "didi_dighomi": "დიდი-დიღომი",
    "close": "დახურვა",
    "Enter_Your_Name": "შეიყვანეთ თქვენი სახელი",
    "Enter_Your_Email": "შეიყვანეთ თქვენი ელ-ფოსტა",
    "message": "შეტყობინება",
    "thank_you": "მადლობა",
    "success_message": "შეტყობინება წარმატებით გაიგზავნა",
    "email_valid_error": "მოცემული ელ-ფოსტა არასწორია.",
    "send_message": "გაგზავნა",
    "h": "გ",
    "i": "მ",
    "hello_text": "ამარჯობა, ჩემი სახელია საბა ჯმუხაძე თბილისიდან, ვარ თვითნასწავლი Full-Stack დეველოპერი ვარ დეტალებზე ორიენტირებული, ზოგადად ეს არის ის, რაც პროგრამისტს სჭირდება, ყოველთვის მაინტერესებდა თუ როგორ იქმნებოდა თამაშები და ვებსაიტები, ასე რომ, ერთ დღეს მე გადავწყვიტე დამოუკიდებლად მესწავლა, ვფიქრობ, უნივერსიტეტი ან კოლეჯი არ არის აუცილებელი, რომ გახდე პროფესიონალი მთავარია, რაც შეიძლება მეტი იმუშაო საკუთარ თავთან. ჩემი მიზანია მივიღო გამოცდილება სამსახურში და ყოველდღიური სწავლა თვითგანვითარებისთვის",
    "start_learning_text": "ე დავიწყე კოდის სწავლა freeCodeCamp.org-დან, იხილეთ ჩემი სერთიფიკატების ბმულები ქვემოთ, შემდეგ გავაგრძელე სწავლა YouTube-იდან, როგორც ყოველთვის, როგორც ამას ყველა თვითნასწავლი დეველოპერი აკეთებს, მაგრამ მე არ მივეკუთნები იმ კატეგორიას, ვინც მთელი დღე უყურებს გაკვეთილებს, თუ როგორ აკეთო ესა თუ ის, ჩემი აზრით ნამდვილი სწავლა იწყება პრაქტიკით, აუცილებლად უნდა შექმნა რამდენიმე პროექტი, თავიდან ბევრ შეცდომას დაუშვებ, მაგრამ პრაქტიკა ყველაფერს უკეთესობისკენ შეცვლის",
    "external_links": "დამატებითი ლინკები",
    "education": "განათლება",
    "georgian_technical_university": "საქართველოს ტექნიკური უნივერსიტეტი",
    "bachelors_degree_in_architecture": "ბაკალავრის ხარისხი არქიტექტურაში",
    "my_skills_are": "ჩემი უნარები",
    "created_title": "მე შევქმენი რამდენიმე ვებსაიტი React.JS-ის გამოყენებით. უბრალოდ აირჩიეთ ის, რაც მოგწონთ და დაათვალიერეთ.",
    "s": "შ",
    "note_text": "გთხოვთ გაითვალისწინოთ, რომ ქვემოთ მოცემული პროექტების უმეტესობა შეიქმნა, როდესაც მე ვიყავი უმცროსი დეველოპერი და პროექტები ჯერ კიდევ დამუშავების პროცესშია. თითოეულ პროექტზე საშუალოდ ორი დღე ვიმუშავე და უახლოეს მომავალში ვაპირებ მათ განახლებას.",
    "view_project": "ნახე პროექტი",
    "bazargeDesc": "ეს აპლიკაცია ემსახურება ონლაინ ყიდვა-გაყიდვას ამჟამად ვმუშაობ ამ პროექტზე ვაპირებ სხვა ბევრი ფუნქციონალის დამატებს. თქვენ შეგიძლიათ გაიაროთ რეგისტრაცია, ავტორიზაცია და განათავსოთ თქვენი განცხადება.",
    "developer": "დეველოპერი",
    "my_new_project_title": "ჩემი ახალი პატარა E-commerce პროექტი",
    "my_new_project_text": "შევქმენი React.JS ის გამოყენებით, გამოვიყენე აპლიკაციის ეწ. მდგომარეობის მართვის ხელსაწყოები როგორიცაა, Context-api და Redux-toolkit.",
    "all_rights_reserved": "ყველა უფლება დაცულია - ავტორი საბა ჯმუხაძე",
    "gta_sanandreas_text": "ჩემი პორტფოლიოს ვებსაიტს აქვს შეცვლილი საუნდტრეკი, შთაგონებული 'GTA San Andreas'-ის საკულტო მუსიკით, განკუთვნილია მხოლოდ გასართობი მიზნებისთვის. ის არ არღვევს საავტორო უფლებებს და არ ამტკიცებს ორიგინალი კომპოზიციის მფლობელობას."
  }
}
